app/views/welcome/homepage.html.erb

                                <strong>
                                    <%= review.user.first_name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]