app/controllers/welcome_controller.rb

SELECT "reviews".* FROM "reviews" ORDER BY reviews.rating DESC
---
  def homepage
    @query = Location.ransack(params[:q])

    @users = User.all
    @top_review_users = []
    @reviews = Review.order('reviews.rating DESC').all